Revit 2027 API
CurveArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual CurveArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As CurveArrayIterator
public:
virtual CurveArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> CurveArrayIterator
override ForwardIterator : unit -> CurveArrayIterator
Return Value
CurveArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
CurveArray Class
Autodesk.Revit.DB Namespace